==> (a)
==> (a b)
==> ("Bonjour" Bonjour #\a #\b #\t 1234)
==> if a la valeur 1
and a la valeur 2
or a la valeur 3
quote a la valeur 4
define a la valeur 5
set! a la valeur 6
+ a la valeur 
- a la valeur 
* a la valeur 
/ a la valeur 
= a la valeur 
< a la valeur 
> a la valeur 
null? a la valeur 
boolean? a la valeur 
symbol? a la valeur 
pair? a la valeur 
string? a la valeur 
character? a la valeur 
integer? a la valeur 
primitive? a la valeur 
chartointeger a la valeur 
integertochar a la valeur 
numbertostring a la valeur 
stringtosymbol a la valeur 
symboltostring a la valeur 
stringtonumber a la valeur 
car a la valeur 
cdr a la valeur 
set-car! a la valeur 
set-cdr! a la valeur 
list! a la valeur 
eq? a la valeur 
a a la valeur 1

==> if a la valeur 1
and a la valeur 2
or a la valeur 3
quote a la valeur 4
define a la valeur 5
set! a la valeur 6
+ a la valeur 
- a la valeur 
* a la valeur 
/ a la valeur 
= a la valeur 
< a la valeur 
> a la valeur 
null? a la valeur 
boolean? a la valeur 
symbol? a la valeur 
pair? a la valeur 
string? a la valeur 
character? a la valeur 
integer? a la valeur 
primitive? a la valeur 
chartointeger a la valeur 
integertochar a la valeur 
numbertostring a la valeur 
stringtosymbol a la valeur 
symboltostring a la valeur 
stringtonumber a la valeur 
car a la valeur 
cdr a la valeur 
set-car! a la valeur 
set-cdr! a la valeur 
list! a la valeur 
eq? a la valeur 
a a la valeur 1
b a la valeur 2

==> if a la valeur 1
and a la valeur 2
or a la valeur 3
quote a la valeur 4
define a la valeur 5
set! a la valeur 6
+ a la valeur 
- a la valeur 
* a la valeur 
/ a la valeur 
= a la valeur 
< a la valeur 
> a la valeur 
null? a la valeur 
boolean? a la valeur 
symbol? a la valeur 
pair? a la valeur 
string? a la valeur 
character? a la valeur 
integer? a la valeur 
primitive? a la valeur 
chartointeger a la valeur 
integertochar a la valeur 
numbertostring a la valeur 
stringtosymbol a la valeur 
symboltostring a la valeur 
stringtonumber a la valeur 
car a la valeur 
cdr a la valeur 
set-car! a la valeur 
set-cdr! a la valeur 
list! a la valeur 
eq? a la valeur 
a a la valeur 3
b a la valeur 2

==> if a la valeur 1
and a la valeur 2
or a la valeur 3
quote a la valeur 4
define a la valeur 5
set! a la valeur 6
+ a la valeur 
- a la valeur 
* a la valeur 
/ a la valeur 
= a la valeur 
< a la valeur 
> a la valeur 
null? a la valeur 
boolean? a la valeur 
symbol? a la valeur 
pair? a la valeur 
string? a la valeur 
character? a la valeur 
integer? a la valeur 
primitive? a la valeur 
chartointeger a la valeur 
integertochar a la valeur 
numbertostring a la valeur 
stringtosymbol a la valeur 
symboltostring a la valeur 
stringtonumber a la valeur 
car a la valeur 
cdr a la valeur 
set-car! a la valeur 
set-cdr! a la valeur 
list! a la valeur 
eq? a la valeur 
a a la valeur 3
b a la valeur 4

